src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйКассовыйОрдер</name>
  <basedOn>Document.ПоступлениеТоваровИУслуг</basedOn>
  <basedOn>Document.Реализация</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасходаДенег</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровИУслуг</types>
      <types>DocumentRef.Реализация</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/Enums/ВидыОперацийРасходаДенег/ВидыОперацийРасходаДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходаДенег</name>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаПодотчетнику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаработнойПлаты</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.МатериалыЗаказчиков</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <comment>Клиент</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыЗаказчика</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеМатериала</name>
      <type>
        <types>EnumRef.СостояниеМатериаловКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Использован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
    </items>
    <items>
      <name>РасходыНаПродажу</name>
      <description>Расходы на продажу</description>
      <code>44</code>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчет с поставщиками</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПокупателями</name>
      <description>Расчеты с покупателями</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПерсоналомПоОплатеТруда</name>
      <description>Расчеты с персоналом по оплате труда</description>
      <code>70</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПодотчетнымиЛицами</name>
      <description>Расчет с подотчетными лицами</description>
      <code>71</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПрочиеДоходыИРасходы</name>
      <description>Прочие доходы и расходы</description>
      <code>91</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

src/Documents/РасходныйКассовыйОрдер/ObjectModule.bsl
// Модуль объекта документа "РасходныйКассовыйОрдер".
// Содержит:
//   1. Обработчик заполнения "на основании" документов "Реализация" и "ПоступлениеТоваровИУслуг".
//   2. Основную логику проведения: движения по регистру "ДенежныеСредства" (расход)
//      и бухгалтерские проводки в зависимости от вида операции.
//   3. Вспомогательные функции получения аналитики проводок и данных основания.

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    ТипДокументаОснования = ТипЗнч(ДанныеЗаполнения);
    
    ТипДокументаРеализация = Тип("ДокументСсылка.Реализация");
    ТипДокументаПоступлениеТоваровИУслуг = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг");
    
    ДанныеЗаполненияОснования = Новый Структура;
    Если ТипДокументаОснования = ТипДокументаРеализация Тогда
        ДанныеЗаполненияОснования = ПолучитьДанныеПоРеализации(ДанныеЗаполнения);
    ИначеЕсли ТипДокументаОснования = ТипДокументаПоступлениеТоваровИУслуг Тогда 
        ДанныеЗаполненияОснования = ПолучитьДанныеПоПоступлениюТоваровИУслуг(ДанныеЗаполнения);
    КонецЕсли;
    ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполненияОснования);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
    Движения.ДенежныеСредства.Записывать = Истина;
    Движения.ДенежныеСредства.Записать();
    Движения.Хозрасчетный.Записывать = Истина;

    Движение = Движения.ДенежныеСредства.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период = Дата;
    Движение.Касса = Касса;
    Движение.Сумма = СуммаДокумента;
    
    АналитикаПроводки = ПолучитьАналитикуПроводки();
        
    Движение = Движения.Хозрасчетный.Добавить();
    Движение.СчетДт = АналитикаПроводки.СчетДебета;
    Движение.СчетКт = АналитикаПроводки.СчетКредита;
    Движение.Период = Дата;
    Движение.Сумма = СуммаДокумента;
    Движение.Содержание = АналитикаПроводки.СодержаниеОперации;
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, АналитикаПроводки.СубконтоДебет);
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, АналитикаПроводки.СубконтоКредит);
    
    Движения.Записать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеПоРеализации(ДанныеЗаполнения)
    Запрос = Новый Запрос; 
    Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);    
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Реализация.Ссылка КАК ДокументОснование,
    |    Реализация.Контрагент КАК Получатель,
    |    Реализация.СуммаДокумента КАК СуммаДокумента,
    |    ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходаДенег.ВозвратПокупателю) КАК ВидОперации
    |ИЗ
    |    Документ.Реализация КАК Реализация
    |ГДЕ
    |    Реализация.Ссылка = &Ссылка";
    
    Выборка = Запрос.Выполнить().Выбрать();
    Выборка.Следующий(); 
    Возврат Выборка; 
КонецФункции

Функция ПолучитьДанныеПоПоступлениюТоваровИУслуг(ДанныеЗаполнения)
    Запрос = Новый Запрос; 
    Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);    
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ПоступлениеТоваровИУслуг.Ссылка КАК ДокументОснование,
    |    ПоступлениеТоваровИУслуг.Контрагент КАК Получатель,
    |    ПоступлениеТоваровИУслуг.Договор КАК Договор,
    |    ПоступлениеТоваровИУслуг.СуммаДокумента КАК СуммаДокумента,
    |    ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходаДенег.ОплатаПоставщику) КАК ВидОперации
    |ИЗ
    |    Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
    |ГДЕ
    |    ПоступлениеТоваровИУслуг.Ссылка = &Ссылка";
    
    Выборка = Запрос.Выполнить().Выбрать();
    Выборка.Следующий(); 
    Возврат Выборка;  
КонецФункции

Функция ПолучитьАналитикуПроводки()
    ОплатаПоставщику         = Перечисления.ВидыОперацийРасходаДенег.ОплатаПоставщику;
    ВозвратПокупателю        = Перечисления.ВидыОперацийРасходаДенег.ВозвратПокупателю;
    ВыдачаПодотчетнику       = Перечисления.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику;
    ВыплатаЗарабатнойПлаты   = Перечисления.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты;    
        
    СтруктураАналитики = Новый Структура;
    СтруктураАналитики.Вставить("СчетКредита", ПланыСчетов.Хозрасчетный.Касса);
    СтруктураАналитики.Вставить("СубконтоКредит", Касса);

    Если ВидОперации = ОплатаПоставщику Тогда
        СтруктураАналитики.Вставить("СчетДебета", ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками);
        СтруктураАналитики.Вставить("СубконтоДебет", Получатель);
        СтруктураАналитики.Вставить("СодержаниеОперации", "Оплата поставщику наличными из кассы");
    ИначеЕсли ВидОперации = ВозвратПокупателю Тогда
        СтруктураАналитики.Вставить("СчетДебета", ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);    
        СтруктураАналитики.Вставить("СубконтоДебет", Получатель);
        СтруктураАналитики.Вставить("СодержаниеОперации", "Возврат покупателю наличными из кассы");
    ИначеЕсли ВидОперации = ВыдачаПодотчетнику Тогда
        СтруктураАналитики.Вставить("СчетДебета", ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами);
        СтруктураАналитики.Вставить("СубконтоДебет", Получатель);
        СтруктураАналитики.Вставить("СодержаниеОперации", "Выдача в подотчет наличных из кассы");
    ИначеЕсли ВидОперации = ВыплатаЗарабатнойПлаты Тогда 
        СтруктураАналитики.Вставить("СчетДебета", ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
        СтруктураАналитики.Вставить("СубконтоДебет", Получатель);
        СтруктураАналитики.Вставить("СодержаниеОперации", "Выплата заработной платы наличными из кассы");
    КонецЕсли;
    Возврат СтруктураАналитики;
КонецФункции

#КонецОбласти
